python_gc.org
#+OPTIONS: H:3 num:t toc:t \n:nil @:t ::t |:t ^:{} _:{} -:t f:t *:t <:t todo:t
#+INFOJS_OPT: view:t toc:t ltoc:t mouse:underline buttons:0 path:org-info.js
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="solarized-dark.css" />
#+KEYWORDS: python gc
#+HTML_LINK_HOME: https://pimiento.github.io/
#+HTML_LINK_UP: https://pimiento.github.io/
#+TITLE: GC в Python

** Как Python управляет памятью
   Детали того как Python управляет памятью зависят от реализации Python. Стандартная реализация Python на C использует подсчёт ссылок для выявления /недостежимых/ объектов и отдельный механизм для отслеживания и управления циклическими ссылками, периодически вызывая алгоритм обнаружения циклических ссылок, который смотрит на /недостижимые циклы/ и удаляет объект, входящие в такие циклические зависимости. Модуль *gc* предоставляет интерфейс для принудительного вызова функций /сборки мусора/, получения статистики и оптимизации параметров коллектора.

    Иногда объекты остаются в /трейсбэках/ и не могут быть деаллоцированы, как мы того ожидаем. Чтобы очистить /трейсбэки/:
    #+BEGIN_SRC python
      import sys
      sys.exc_clear()
      sys.exc_traceback = sys.last_traceback = None
    #+END_SRC

*** getrefcount
    #+BEGIN_SRC python :results output :exports both
      import sys
      foobar = "Hello World"
      barfoo = foobar
      print(sys.getrefcount(foobar))
      print(sys.getrefcount(barfoo))
      del foobar
      print(sys.getrefcount(barfoo))
    #+END_SRC

    #+RESULTS:
    : 5
    : 5
    : 4

    Всегда отнимаем единицы от getrefcount — она автоматически добавляется при вызове функции. (В оригинале статьи sys.getrefcount(foobar) -> 3, sys.getrefcount(barfoo) -> 3). Когда удаляется ссылка, счётчик уменьшается на единицу. Когда он становится равным нулю — удаляется сам объект. Это — *decref* (по названию макроса в C API, делающего всю работу).

*** Дерево и decref
    #+BEGIN_SRC python
      import sys


      class Parent(object):

          def __init__(self):
              self.children = []

          def add(self, ch):
              self.children.append(ch)
              ch.parent = self


      class Child(object):

          def __init__(self):
              self.parent = None

      p = Parent()
      p.add(Child())
    #+END_SRC


    Parent имеет ссылку на child, а тот в свою очередь — на родителя. Объекты останутся в памяти, даже если мы удалим все внешние ссылки на них. Результат — мусор!

*** Garbage Collector
    Для решения предыдущей проблемы в Python появился GC (с 2.1+). В GC реализован /cycle finder/, который отыскивает циклические зависимости. Т.е. если объект ссылается на другой объект, а второй объект ссылается на первый и никто не ссылается на них снаружи, то эти объекты попадут под GC и их успешно разименуют. Пиковое потребление памяти при этом может быть довольно большим. Проблемы возникают, когда один из объектов циклической зависимости имеет метод __del__ или написан как /extension/, т.е. не на Python. Для решения таких проблем появился модуль *weakref* — слабая ссылка, которая как бы видит другой объект, но при этом не увеличивает его счётчик.
** Сборщик мусора
   Сборщик мусора имеет три поколения (0, 1, 2). При создании объекта, он попадает в /нулевое поколение/. У каждого поколения есть *счётчик* и *порог*:
   + При добавлении объекта в поколение счётчик увеличивается.
   + При выбывании из поколения счётчик уменьшается.
   + Когда *счётчик превысит пороговое значение* — по всем объектам из поколения пройдётся сборщик мусора. Кого найдёт — удалит.
   + Все выжившие в поколении объекты перемещаются в следующее (0 → 1, 1 → 2, 1 → 2). Из второго поколения объекты никуда не попадают и _остаются там навечно_.
   + Перемещённые в следующее поколение объекты меняют соответствующий счётчик, и операция может повториться уже для следующего поколения.
   + Счётчик текущего поколения сбрасывается.

   Объекты, подлежащие уничтожение, но имеющие переопределённый метод __del__, не могут быть собраны. Причина проста: эти объекты могут ссылаться друг на друга. Python не способен определить безопасный порядок вызова __del__. Если вызвать деструкторы в произвольном порядке, то можно получить ситуацию вида:
   + Деструктор объекта $a$ для работы требует объект $b$.
   + Последний в своём деструкторе обращается к объекту $a$.
   + При вызове __del__ у $a$ деструктор $b$ не сможет отработать нормально. Ссылка на $a$ будет значение None.

   Чтобы не заставлять программиста корректно разрешать такие ситуации было принято решение не уничтожать подобные объекты а просто перемещать их в gc.garbage.
