python_gc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-25 Wed 22:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GC в Python</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pavel Vavilin" />
<meta name="keywords" content="python gc" />
<link rel="stylesheet" type="text/css" href="solarized-dark.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://pimiento.github.io/"> UP </a>
 |
 <a accesskey="H" href="https://pimiento.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">GC в Python</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3b2b6c1">1. Как Python управляет памятью</a>
<ul>
<li><a href="#orgc44ef78">1.1. getrefcount</a></li>
<li><a href="#org9f88008">1.2. Дерево и decref</a></li>
<li><a href="#org7a6e6f0">1.3. Garbage Collector</a></li>
</ul>
</li>
<li><a href="#orgb88f6bd">2. Сборщик мусора</a></li>
<li><a href="#orge2a7ade">3. Слабые ссылки, weakref</a>
<ul>
<li><a href="#org33e5e2b">3.1. Proxy</a></li>
<li><a href="#org8932764">3.2. Циклические ссылки, Cyclic references</a></li>
<li><a href="#org8b1602e">3.3. Dead-on-arrival</a></li>
</ul>
</li>
<li><a href="#org585ff50">4. Ссылки</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3b2b6c1" class="outline-2">
<h2 id="org3b2b6c1"><span class="section-number-2">1</span> Как Python управляет памятью</h2>
<div class="outline-text-2" id="text-1">
<p>
Детали того как Python управляет памятью зависят от реализации Python. Стандартная реализация Python на C использует подсчёт ссылок для выявления <i>недостежимых</i> объектов и отдельный механизм для отслеживания и управления циклическими ссылками, периодически вызывая алгоритм обнаружения циклических ссылок, который смотрит на <i>недостижимые циклы</i> и удаляет объект, входящие в такие циклические зависимости. Модуль <b>gc</b> предоставляет интерфейс для принудительного вызова функций <i>сборки мусора</i>, получения статистики и оптимизации параметров коллектора.
</p>

<p>
Иногда объекты остаются в <i>трейсбэках</i> и не могут быть деаллоцированы, как мы того ожидаем. Чтобы очистить <i>трейсбэки</i>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00ff00; font-weight: bold;">import</span> sys
sys.exc_clear()
<span style="color: #ffffff;">sys.exc_traceback</span> = <span style="color: #ffffff;">sys.last_traceback</span> = <span style="color: #7fffd4;">None</span>
</pre>
</div>
</div>

<div id="outline-container-orgc44ef78" class="outline-3">
<h3 id="orgc44ef78"><span class="section-number-3">1.1</span> getrefcount</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00ff00; font-weight: bold;">import</span> sys
<span style="color: #ffffff;">foobar</span> = <span style="color: #ffa500;">"Hello World"</span>
<span style="color: #ffffff;">barfoo</span> = foobar
<span style="color: #00ff00; font-weight: bold;">print</span>(sys.getrefcount(foobar))
<span style="color: #00ff00; font-weight: bold;">print</span>(sys.getrefcount(barfoo))
<span style="color: #00ff00; font-weight: bold;">del</span> foobar
<span style="color: #00ff00; font-weight: bold;">print</span>(sys.getrefcount(barfoo))
</pre>
</div>

<pre class="example">
5
5
4

</pre>

<p>
Всегда отнимаем единицы от getrefcount — она автоматически добавляется при вызове функции. (В оригинале статьи sys.getrefcount(foobar) -&gt; 3, sys.getrefcount(barfoo) -&gt; 3). Когда удаляется ссылка, счётчик уменьшается на единицу. Когда он становится равным нулю — удаляется сам объект. Это — <b>decref</b> (по названию макроса в C API, делающего всю работу).
</p>
</div>
</div>

<div id="outline-container-org9f88008" class="outline-3">
<h3 id="org9f88008"><span class="section-number-3">1.2</span> Дерево и decref</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00ff00; font-weight: bold;">import</span> sys


<span style="color: #00ff00; font-weight: bold;">class</span> <span style="color: #00ffff;">Parent</span>(<span style="color: #b0c4de; font-weight: bold;">object</span>):

    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">__init__</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">self</span>.children = []

    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">add</span>(<span style="color: #00ff00; font-weight: bold;">self</span>, ch):
        <span style="color: #00ff00; font-weight: bold;">self</span>.children.append(ch)
        <span style="color: #ffffff;">ch.parent</span> = <span style="color: #00ff00; font-weight: bold;">self</span>


<span style="color: #00ff00; font-weight: bold;">class</span> <span style="color: #00ffff;">Child</span>(<span style="color: #b0c4de; font-weight: bold;">object</span>):

    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">__init__</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">self</span>.parent = <span style="color: #7fffd4;">None</span>

<span style="color: #ffffff;">p</span> = Parent()
p.add(Child())
</pre>
</div>


<p>
Parent имеет ссылку на child, а тот в свою очередь — на родителя. Объекты останутся в памяти, даже если мы удалим все внешние ссылки на них. Результат — мусор!
</p>
</div>
</div>

<div id="outline-container-org7a6e6f0" class="outline-3">
<h3 id="org7a6e6f0"><span class="section-number-3">1.3</span> Garbage Collector</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Для решения предыдущей проблемы в Python появился GC (с 2.1+). В GC реализован <i>cycle finder</i>, который отыскивает циклические зависимости. Т.е. если объект ссылается на другой объект, а второй объект ссылается на первый и никто не ссылается на них снаружи, то эти объекты попадут под GC и их успешно разименуют. Пиковое потребление памяти при этом может быть довольно большим. Проблемы возникают, когда один из объектов циклической зависимости имеет метод <span class="underline"><span class="underline">del</span></span> или написан как <i>extension</i>, т.е. не на Python. Для решения таких проблем появился модуль <b>weakref</b> — слабая ссылка, которая как бы видит другой объект, но при этом не увеличивает его счётчик.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb88f6bd" class="outline-2">
<h2 id="orgb88f6bd"><span class="section-number-2">2</span> Сборщик мусора</h2>
<div class="outline-text-2" id="text-2">
<p>
Сборщик мусора имеет три поколения (0, 1, 2). При создании объекта, он попадает в <i>нулевое поколение</i>. У каждого поколения есть <b>счётчик</b> и <b>порог</b>:
</p>
<ul class="org-ul">
<li>При добавлении объекта в поколение счётчик увеличивается.</li>
<li>При выбывании из поколения счётчик уменьшается.</li>
<li>Когда <b>счётчик превысит пороговое значение</b> — по всем объектам из поколения пройдётся сборщик мусора. Кого найдёт — удалит.</li>
<li>Все выжившие в поколении объекты перемещаются в следующее (0 → 1, 1 → 2, 1 → 2). Из второго поколения объекты никуда не попадают и <span class="underline">остаются там навечно</span>.</li>
<li>Перемещённые в следующее поколение объекты меняют соответствующий счётчик, и операция может повториться уже для следующего поколения.</li>
<li>Счётчик текущего поколения сбрасывается.</li>
</ul>

<p>
Объекты, подлежащие уничтожение, но имеющие переопределённый метод <span class="underline"><span class="underline">del</span></span>, не могут быть собраны. Причина проста: эти объекты могут ссылаться друг на друга. Python не способен определить безопасный порядок вызова <span class="underline"><span class="underline">del</span></span>. Если вызвать деструкторы в произвольном порядке, то можно получить ситуацию вида:
</p>
<ul class="org-ul">
<li>Деструктор объекта \(a\) для работы требует объект \(b\).</li>
<li>Последний в своём деструкторе обращается к объекту \(a\).</li>
<li>При вызове <span class="underline"><span class="underline">del</span></span> у \(a\) деструктор \(b\) не сможет отработать нормально. Ссылка на \(a\) будет значение None.</li>
</ul>

<p>
Чтобы не заставлять программиста корректно разрешать такие ситуации было принято решение не уничтожать подобные объекты а просто перемещать их в gc.garbage.
</p>
</div>
</div>
