python_gc.org
** Слабые ссылки, weakref
   Обычно, объекты не будут удалены пока не будут удалены все ссылки на них:
   #+BEGIN_SRC python :results output :exports both
     class Foo(object):
         def __init__(self):
             self.obj = None
             print('created')
         def __del__(self):
             print('destroyed')
         def show(self):
             print(self.obj)
         def store(self, obj):
             self.obj = obj

     print("> a = Foo()")
     a = Foo()
     print("> b = a")
     b = a
     print("> del a")
     del a
     print("> del b")
     del b
   #+END_SRC

   #+RESULTS:
   : > a = Foo()
   : created
   : > b = a
   : > del a
   : > del b
   : destroyed

   Слабые ссылки, напротив, не увеличивают счётчик ссылок на объект. Существование слабой ссылки на объект никогда не воспрепятствует уничтожению объекта. Т.о., если на объект указывают только слабые ссылки, то это этот объект будет уничтожен.
   #+BEGIN_SRC python :results output :exports both
     import weakref

     class Foo(object):
         def __init__(self):
             self.obj = None
             print('created')
         def __del__(self):
             print('destroyed')
         def show(self):
             print(self.obj)
         def store(self, obj):
             self.obj = obj

     print("> a = Foo()")
     a = Foo()
     print("> b = weakref.ref(a)")
     b = weakref.ref(a)
     print("> a == b()")
     print(a == b())
     print("b().show()")
     b().show()
     print("del a")
     del a
     print("b() is None")
     print(b() is None)
   #+END_SRC

   #+RESULTS:
   #+begin_example
   > a = Foo()
   created
   > b = weakref.ref(a)
   > a == b()
   True
   b().show()
   None
   del a
   destroyed
   b() is None
   True
#+end_example
*** Proxy
    В качестве более простой альтернативы *weakref.ref* можно использовать *weakref.proxy*. Proxy-объект ведёт себя как /сильная/ ссылка на объект, но выбрасывает /exception/ когда используется послет того как оригинальный объект был удалён.
    #+BEGIN_SRC python :results output :exports both
      import weakref

      class Foo(object):
          def __init__(self):
              self.obj = None
              print('created')
          def __del__(self):
              print('destroyed')
          def show(self):
              print(self.obj)
          def store(self, obj):
              self.obj = obj

      print("> a = Foo()")
      a = Foo()
      print("> b = weakref.proxy(a)")
      b = weakref.proxy(a)
      print("> b.store('fish')")
      b.store('fish')
      print("> b.show()")
      b.show()
      print("> del a")
      del a
      print("> b.show() # -> will produce exception ReferenceError")
      # b.show() -> will produce exception
    #+END_SRC

    #+RESULTS:
    : > a = Foo()
    : created
    : > b = weakref.proxy(a)
    : > b.store('fish')
    : > b.show()
    : fish
    : > del a
    : destroyed
    : > b.show()
