python_gc.html
<div id="outline-container-orge2a7ade" class="outline-2">
<h2 id="orge2a7ade"><span class="section-number-2">3</span> Слабые ссылки, weakref</h2>
<div class="outline-text-2" id="text-3">
<p>
Обычно, объекты не будут удалены пока не будут удалены все ссылки на них:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00ff00; font-weight: bold;">class</span> <span style="color: #00ffff;">Foo</span>(<span style="color: #b0c4de; font-weight: bold;">object</span>):
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">__init__</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">self</span>.obj = <span style="color: #7fffd4;">None</span>
        <span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">'created'</span>)
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">__del__</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">'destroyed'</span>)
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">show</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #00ff00; font-weight: bold;">self</span>.obj)
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">store</span>(<span style="color: #00ff00; font-weight: bold;">self</span>, obj):
        <span style="color: #00ff00; font-weight: bold;">self</span>.obj = obj

<span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">"&gt; a = Foo()"</span>)
<span style="color: #ffffff;">a</span> = Foo()
<span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">"&gt; b = a"</span>)
<span style="color: #ffffff;">b</span> = a
<span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">"&gt; del a"</span>)
<span style="color: #00ff00; font-weight: bold;">del</span> a
<span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">"&gt; del b"</span>)
<span style="color: #00ff00; font-weight: bold;">del</span> b
</pre>
</div>

<pre class="example">
&gt; a = Foo()
created
&gt; b = a
&gt; del a
&gt; del b
destroyed

</pre>

<p>
Слабые ссылки, напротив, не увеличивают счётчик ссылок на объект. Существование слабой ссылки на объект никогда не воспрепятствует уничтожению объекта. Т.о., если на объект указывают только слабые ссылки, то это этот объект будет уничтожен.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00ff00; font-weight: bold;">import</span> weakref

<span style="color: #00ff00; font-weight: bold;">class</span> <span style="color: #00ffff;">Foo</span>(<span style="color: #b0c4de; font-weight: bold;">object</span>):
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">__init__</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">self</span>.obj = <span style="color: #7fffd4;">None</span>
        <span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">'created'</span>)
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">__del__</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">'destroyed'</span>)
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">show</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #00ff00; font-weight: bold;">self</span>.obj)
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">store</span>(<span style="color: #00ff00; font-weight: bold;">self</span>, obj):
        <span style="color: #00ff00; font-weight: bold;">self</span>.obj = obj

<span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">"&gt; a = Foo()"</span>)
<span style="color: #ffffff;">a</span> = Foo()
<span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">"&gt; b = weakref.ref(a)"</span>)
<span style="color: #ffffff;">b</span> = weakref.ref(a)
<span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">"&gt; a == b()"</span>)
<span style="color: #00ff00; font-weight: bold;">print</span>(a == b())
<span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">"b().show()"</span>)
b().show()
<span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">"del a"</span>)
<span style="color: #00ff00; font-weight: bold;">del</span> a
<span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">"b() is None"</span>)
<span style="color: #00ff00; font-weight: bold;">print</span>(b() <span style="color: #00ff00; font-weight: bold;">is</span> <span style="color: #7fffd4;">None</span>)
</pre>
</div>

<pre class="example">
&gt; a = Foo()
created
&gt; b = weakref.ref(a)
&gt; a == b()
True
b().show()
None
del a
destroyed
b() is None
True
</pre>
</div>
<div id="outline-container-org33e5e2b" class="outline-3">
<h3 id="org33e5e2b"><span class="section-number-3">3.1</span> Proxy</h3>
<div class="outline-text-3" id="text-3-1">
<p>
В качестве более простой альтернативы <b>weakref.ref</b> можно использовать <b>weakref.proxy</b>. Proxy-объект ведёт себя как <i>сильная</i> ссылка на объект, но выбрасывает <i>exception</i> когда используется послет того как оригинальный объект был удалён.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00ff00; font-weight: bold;">import</span> weakref

<span style="color: #00ff00; font-weight: bold;">class</span> <span style="color: #00ffff;">Foo</span>(<span style="color: #b0c4de; font-weight: bold;">object</span>):
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">__init__</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">self</span>.obj = <span style="color: #7fffd4;">None</span>
        <span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">'created'</span>)
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">__del__</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">'destroyed'</span>)
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">show</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #00ff00; font-weight: bold;">self</span>.obj)
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">store</span>(<span style="color: #00ff00; font-weight: bold;">self</span>, obj):
        <span style="color: #00ff00; font-weight: bold;">self</span>.obj = obj

<span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">"&gt; a = Foo()"</span>)
<span style="color: #ffffff;">a</span> = Foo()
<span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">"&gt; b = weakref.proxy(a)"</span>)
<span style="color: #ffffff;">b</span> = weakref.proxy(a)
<span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">"&gt; b.store('fish')"</span>)
b.store(<span style="color: #ffa500;">'fish'</span>)
<span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">"&gt; b.show()"</span>)
b.show()
<span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">"&gt; del a"</span>)
<span style="color: #00ff00; font-weight: bold;">del</span> a
<span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">"&gt; b.show() # -&gt; will produce exception ReferenceError"</span>)
<span style="color: #5F7F5F;"># </span><span style="color: #ffa500; font-style: italic;">b.show() -&gt; will produce exception</span>
</pre>
</div>

<pre class="example">
&gt; a = Foo()
created
&gt; b = weakref.proxy(a)
&gt; b.store('fish')
&gt; b.show()
fish
&gt; del a
destroyed
&gt; b.show() # -&gt; will produce exception ReferenceError

</pre>
</div>
</div>
