python_gc.org
*** Циклические ссылки, Cyclic references
    Необходимость в слабых ссылках возрастает когда объекты имеющие сильные ссылки образуют /циклы/.
    #+BEGIN_SRC python :results output
      class Foo(object):
          def __init__(self):
              self.obj = None
              print('created')
          def __del__(self):
              print('destroyed')
          def show(self):
              print(self.obj)
          def store(self, obj):
              self.obj = obj

      a = Foo()
      # created
      b = Foo()
      # created
      a.store(b)
      b.store(a)
      del a
      del b
    #+END_SRC
    Метод-деструктор для $a$ и $b$ никогда не будет вызван и объекты будут жить в памяти до момента окончания работы интерпретатора. Подобные примеры циклической зависимости могут быть в двусвязных списках, в деревьях. Решение проблемы — хранить слабые ссылки.
    #+BEGIN_SRC python :results output
      import weakref

      class Foo(object):
          def __init__(self):
              self.obj = None
              print('created')
          def __del__(self):
              print('destroyed')
          def show(self):
              print(self.obj)
          def store(self, obj):
              self.obj = weakref.ref(obj)

      a = Foo()
      # created
      b = Foo()
      # created
      c = Foo()
      # created
      a.store(b)
      b.store(c)
      c.store(a)
      del a
      # destroyed
      del b
      # destroyed
      del c
      # destroyed
    #+END_SRC

*** Dead-on-arrival
    Модуль *weakref* не может создавать слабые ссылки для всяких объектов. Например, попытка создать слабую ссылку на /list/, /tuple/, /dictionary/, /numeric/, /string/ или /None/ вызовет возникновение *TypeError*. Но иногда создание слабой ссылки падает молча
    #+BEGIN_SRC python :results output
      import weakref

      class Foo(object):
          def __init__(self):
              self.obj = None
              print('created')
          def __del__(self):
              print('destroyed')
          def show(self):
              print(self.obj)
          def store(self, obj):
              self.obj = weakref.ref(obj)

      a = Foo()
      # created
      b = Foo()
      # created
      a.store(b.show)                 # store creates a weak reference
      a.show()
      # <weakref at 0x7f0542a095e8; dead>
    #+END_SRC
    Причина такого поведения в том, что (bound method) b.show создаётся и передаётся в метод Foo.store. Этот метод сохраняет слабую ссылку на b.show и переменную-экземпляр a.obj. Когда /store/ метод заканчивает свою работу, то больше не существует сильной ссылки на метод b.show и таким образом, он автоматически уничтожается. Такая ссылка на b.show называется dead-on-arrival.

** Ссылки
   - [[http://effbot.org/pyfaq/how-does-python-manage-memory.htm][How does Python manage memory]]
   - [[http://asvetlov.blogspot.ru/2013/05/gc.html][Python GC]]
   - [[http://asvetlov.blogspot.ru/2008/11/blog-post.html][Управление памятью в Python]]
   - [[https://mindtrove.info/python-weak-references/][Python Weakref References]]
