python_gc.html
<div id="outline-container-org8932764" class="outline-3">
<h3 id="org8932764"><span class="section-number-3">3.2</span> Циклические ссылки, Cyclic references</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Необходимость в слабых ссылках возрастает когда объекты имеющие сильные ссылки образуют <i>циклы</i>.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00ff00; font-weight: bold;">class</span> <span style="color: #00ffff;">Foo</span>(<span style="color: #b0c4de; font-weight: bold;">object</span>):
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">__init__</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">self</span>.obj = <span style="color: #7fffd4;">None</span>
        <span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">'created'</span>)
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">__del__</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">'destroyed'</span>)
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">show</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #00ff00; font-weight: bold;">self</span>.obj)
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">store</span>(<span style="color: #00ff00; font-weight: bold;">self</span>, obj):
        <span style="color: #00ff00; font-weight: bold;">self</span>.obj = obj

<span style="color: #ffffff;">a</span> = Foo()
<span style="color: #5F7F5F;"># </span><span style="color: #ffa500; font-style: italic;">created</span>
<span style="color: #ffffff;">b</span> = Foo()
<span style="color: #5F7F5F;"># </span><span style="color: #ffa500; font-style: italic;">created</span>
a.store(b)
b.store(a)
<span style="color: #00ff00; font-weight: bold;">del</span> a
<span style="color: #00ff00; font-weight: bold;">del</span> b
</pre>
</div>
<p>
Метод-деструктор для \(a\) и \(b\) никогда не будет вызван и объекты будут жить в памяти до момента окончания работы интерпретатора. Подобные примеры циклической зависимости могут быть в двусвязных списках, в деревьях. Решение проблемы — хранить слабые ссылки.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00ff00; font-weight: bold;">import</span> weakref

<span style="color: #00ff00; font-weight: bold;">class</span> <span style="color: #00ffff;">Foo</span>(<span style="color: #b0c4de; font-weight: bold;">object</span>):
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">__init__</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">self</span>.obj = <span style="color: #7fffd4;">None</span>
        <span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">'created'</span>)
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">__del__</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">'destroyed'</span>)
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">show</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #00ff00; font-weight: bold;">self</span>.obj)
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">store</span>(<span style="color: #00ff00; font-weight: bold;">self</span>, obj):
        <span style="color: #00ff00; font-weight: bold;">self</span>.obj = weakref.ref(obj)

<span style="color: #ffffff;">a</span> = Foo()
<span style="color: #5F7F5F;"># </span><span style="color: #ffa500; font-style: italic;">created</span>
<span style="color: #ffffff;">b</span> = Foo()
<span style="color: #5F7F5F;"># </span><span style="color: #ffa500; font-style: italic;">created</span>
<span style="color: #ffffff;">c</span> = Foo()
<span style="color: #5F7F5F;"># </span><span style="color: #ffa500; font-style: italic;">created</span>
a.store(b)
b.store(c)
c.store(a)
<span style="color: #00ff00; font-weight: bold;">del</span> a
<span style="color: #5F7F5F;"># </span><span style="color: #ffa500; font-style: italic;">destroyed</span>
<span style="color: #00ff00; font-weight: bold;">del</span> b
<span style="color: #5F7F5F;"># </span><span style="color: #ffa500; font-style: italic;">destroyed</span>
<span style="color: #00ff00; font-weight: bold;">del</span> c
<span style="color: #5F7F5F;"># </span><span style="color: #ffa500; font-style: italic;">destroyed</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b1602e" class="outline-3">
<h3 id="org8b1602e"><span class="section-number-3">3.3</span> Dead-on-arrival</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Модуль <b>weakref</b> не может создавать слабые ссылки для всяких объектов. Например, попытка создать слабую ссылку на <i>list</i>, <i>tuple</i>, <i>dictionary</i>, <i>numeric</i>, <i>string</i> или <i>None</i> вызовет возникновение <b>TypeError</b>. Но иногда создание слабой ссылки падает молча
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00ff00; font-weight: bold;">import</span> weakref

<span style="color: #00ff00; font-weight: bold;">class</span> <span style="color: #00ffff;">Foo</span>(<span style="color: #b0c4de; font-weight: bold;">object</span>):
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">__init__</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">self</span>.obj = <span style="color: #7fffd4;">None</span>
        <span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">'created'</span>)
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">__del__</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #ffa500;">'destroyed'</span>)
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">show</span>(<span style="color: #00ff00; font-weight: bold;">self</span>):
        <span style="color: #00ff00; font-weight: bold;">print</span>(<span style="color: #00ff00; font-weight: bold;">self</span>.obj)
    <span style="color: #00ff00; font-weight: bold;">def</span> <span style="color: #00ffff; font-weight: bold;">store</span>(<span style="color: #00ff00; font-weight: bold;">self</span>, obj):
        <span style="color: #00ff00; font-weight: bold;">self</span>.obj = weakref.ref(obj)

<span style="color: #ffffff;">a</span> = Foo()
<span style="color: #5F7F5F;"># </span><span style="color: #ffa500; font-style: italic;">created</span>
<span style="color: #ffffff;">b</span> = Foo()
<span style="color: #5F7F5F;"># </span><span style="color: #ffa500; font-style: italic;">created</span>
a.store(b.show)                 <span style="color: #5F7F5F;"># </span><span style="color: #ffa500; font-style: italic;">store creates a weak reference</span>
a.show()
<span style="color: #5F7F5F;"># </span><span style="color: #ffa500; font-style: italic;">&lt;weakref at 0x7f0542a095e8; dead&gt;</span>
</pre>
</div>
<p>
Причина такого поведения в том, что (bound method) b.show создаётся и передаётся в метод Foo.store. Этот метод сохраняет слабую ссылку на b.show и переменную-экземпляр a.obj. Когда <i>store</i> метод заканчивает свою работу, то больше не существует сильной ссылки на метод b.show и таким образом, он автоматически уничтожается. Такая ссылка на b.show называется dead-on-arrival.
</p>
</div>
</div>
</div>

<div id="outline-container-org585ff50" class="outline-2">
<h2 id="org585ff50"><span class="section-number-2">4</span> Ссылки</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="http://effbot.org/pyfaq/how-does-python-manage-memory.htm">How does Python manage memory</a></li>
<li><a href="http://asvetlov.blogspot.ru/2013/05/gc.html">Python GC</a></li>
<li><a href="http://asvetlov.blogspot.ru/2008/11/blog-post.html">Управление памятью в Python</a></li>
<li><a href="https://mindtrove.info/python-weak-references/">Python Weakref References</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pavel Vavilin</p>
<p class="date">Created: 2017-10-25 Wed 22:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
